{
  "base_model_name_or_path": "",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.0,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": "all-linear",
  "task_type": "CAUSAL_LM"
}